[
  {
    "version": "1.0.0",
    "desc": "First beta release"
  },
  {
    "version": "1.1.0",
    "desc": "Add recipe scripts"
  },
  {
    "version": "1.2.0",
    "desc": "Add skill limit to most mod items, add item physics and other mods that makes game harder"
  },
  {
    "version": "1.2.1",
    "desc": "Add skill limit to items that missed"
  },
  {
    "version": "1.2.2",
    "desc": "First stable release"
  },
  {
    "version": "1.2.3",
    "desc": "Add progressive boss mod to make vanilla boss harder."
  },
  {
    "version": "1.2.4",
    "desc": "Removed body temperature since it makes game nearly unplayable."
  },
  {
    "version": "1.2.5",
    "desc": "Lycanite mob rare subspecies no longer display boss hp bar by default and will despawn."
  },
  {
    "version": "1.2.6",
    "desc": "Lycanite mob event now respect light level, add sulfur dust furnace recipe."
  },
  {
    "version": "1.2.7",
    "desc": "Disabled AquaCulture's fish weight so it's possible to making automatic crafting system."
  },
  {
    "version": "1.2.8",
    "desc": "Mob spawner will spawn much more mobs now (farming possible)"
  },
  {
    "version": "1.3.0",
    "desc": "Add more mods, including modular series, thaum craft series, industrial foregoing, mekanism, elevator, etc."
  },
  {
    "version": "1.3.1",
    "desc": "Add skill restrictions to new items."
  },
  {
    "version": "1.4.0",
    "desc": "Add EnderIO seris and skill restrictions to most of items."
  },
  {
    "version": "1.4.1",
    "desc": "Remove duplicated ore veins"
  },
  {
    "version": "1.5.0",
    "desc": "Add immersive railroading and relative dependencies"
  },
  {
    "version": "1.5.1",
    "desc": "Removed DragonMounts2 due to massive lag/crash/error and discounted; added HarvestCraft. Harvest now gives 2xp but harvest&plant now must use tools"
  },
  {
    "version": "1.5.2",
    "desc": "Sleeping/Fishing/Tree-Chopping no longer spawn mobs, add BetterFPS"
  },
  {
    "version": "1.5.3",
    "desc": "Disable HarvestCraft's fishing pool since it'll overwrite AquaCulture's"
  },
  {
    "version": "1.5.4",
    "desc": "Removed HarvestCraft due to incompatibility with AquaCulture, add skill restriction to thermal's upgrades and lower ic2 tank's requirement. <span style=\"color:yellow\">Stablized modpack content.</span>"
  },
  {
    "version": "1.5.5",
    "desc": "Identified AuqalCulture's fishes can only be obtained via the fishing rod from its mod, not HarvestCraft's fault so added it back. Twilight Forest now will spawn fruit trees."
  },
  {
    "version": "1.5.6",
    "desc": "Railcraft's tanks now holding 25% more fluid, portable tank from ThermalExpansion holds 75% less fluid."
  },
  {
    "version": "1.5.7",
    "desc": "Removed BetterFPS due to incompatible with ModernWarfare (guns unable to shoot). Right-click simple harvest is back and hopefully will gives XP. Now allow drinking from rail."
  },
  {
    "version": "1.5.8",
    "desc": "Activly disabled better survival's spears due to potential crash bugs"
  },
  {
    "version": "1.5.9",
    "desc": "Most of nether mobs from lycanitesmobs will respect light level now"
  },
  {
    "version": "1.5.10",
    "desc": "Update mods to latest version, add NotEnoughIDs"
  },
  {
    "version": "1.5.11",
    "desc": "Update most mods to latest version, add Cooking for blockhead, Tinker's Armor and leveling"
  },
  {
    "version": "1.5.12",
    "desc": "Add serveral handy mods including wireless crafting terminal, upper, klee slabs etc."
  },
  {
    "version": "1.6.0_pre",
    "desc": "Pre-release of latest modpack, update mods to latest and add several new mods including: FlansMod(very unstable!), Enviromental Tech, Action Additions, Hatchery, AppleSkin, Xnet etc."
  }
]